hajimi-yzy/YOLO-Human-Detection-Project-Based-on-STM32H750/communication/固件/esp32s3_l610_ps2_v5/components/web_wifi/include/app_wifi.h
/*
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include "esp_wifi.h"

#ifdef __cplusplus
extern "C" {
#endif

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#define WIFI_BW_HT20 WIFI_BW20
#define WIFI_BW_HT40 WIFI_BW40

#define ESP_IF_WIFI_STA WIFI_IF_STA
#define ESP_IF_WIFI_AP WIFI_IF_AP
#endif

#ifdef CONFIG_WIFI_BANDWIFTH_40
#define MODEM_WIFI_BANDWIFTH WIFI_BW_HT40
#else
#define MODEM_WIFI_BANDWIFTH WIFI_BW_HT20
#endif

/**
 * @brief  Broadcast SSID or not, default 0, broadcast the SSID
 *
 */
#define MODEM_WIFI_DEFAULT_CONFIG()                \
{                                                  \
    .mode = WIFI_MODE_AP,                          \
    .ap_ssid = CONFIG_ESP_WIFI_AP_SSID,            \
    .ap_password = CONFIG_ESP_WIFI_AP_PASSWORD,    \
    .sta_ssid = CONFIG_ESP_WIFI_STA_SSID,          \
    .sta_password = CONFIG_ESP_WIFI_STA_PASSWORD,  \
    .channel = CONFIG_ESP_WIFI_AP_CHANNEL,         \
    .max_connection = CONFIG_MODEM_WIFI_MAX_STA,   \
    .ssid_hidden = 0,                              \
    .authmode = WIFI_AUTH_WPA_WPA2_PSK,            \
    .bandwidth = MODEM_WIFI_BANDWIFTH,             \
}

typedef struct {
    wifi_mode_t mode;              /*!< Wi-Fi Work mode */
    char ap_ssid[32];                 /*!< Wi-Fi SSID of AP mode */
    char ap_password[64];             /*!< Wi-Fi password of AP mode */
    char sta_ssid[32];             /*!< Wi-Fi SSID for station mode*/
    char sta_password[64];         /*!< Wi-Fi password for station mode*/
    char dns[16];                  /*!< Wi-Fi SoftAP DNS address */
    size_t channel;                /*!< Wi-Fi channel of the mode */
    size_t max_connection;         /*!< Wi-Fi max connections of the softap mode */
    size_t ssid_hidden;            /*!< If hide ssid in softap mode */
    wifi_auth_mode_t authmode;     /*!< Wi-Fi authenticate  mode */
    wifi_bandwidth_t bandwidth;    /*!< Wi-Fi bandwidth 20MHz or 40MHz */
} modem_wifi_config_t;

/**
 * @brief Start SoftAP and NAPT internet sharing.
 *
 * The Wi-Fi driver and AP netif are initialized once. Repeated calls are
 * idempotent so cloud control can safely retry a command.
 */
esp_err_t app_wifi_start_softap(const modem_wifi_config_t *config);

/**
 * @brief Stop SoftAP and NAPT internet sharing.
 *
 * The driver and netif remain initialized so the AP can be enabled again.
 */
esp_err_t app_wifi_stop_softap(void);

/**
 * @brief Return whether SoftAP and NAPT completed startup.
 */
bool app_wifi_softap_is_started(void);

/**
 * @brief Get the wifi station netif
 *
 * @return The station netif pointer
 */
esp_netif_t *app_wifi_get_sta_netif(void);

/**
 * @brief Get the wifi softap netif
 *
 * @return The softap netif pointer
 */
esp_netif_t *app_wifi_get_ap_netif(void);

#ifdef __cplusplus
}
#endif
